In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
bycomp = df.groupby('Company')

In [9]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
## Standard deviation
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [14]:
bycomp.sum().iloc[0]

Sales    593
Name: FB, dtype: int64

In [17]:
df.groupby('Company').mean().iloc[2]

Sales    232.0
Name: MSFT, dtype: float64

In [19]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [22]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
! git add Groupby.ipynb
! git commit -m "16:48/04-06-2001"
! git push origin main

On branch main
Your branch is up to date with 'origin/main'.

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	modified:   Dataframe.ipynb
	modified:   Missing_Data.ipynb
	modified:   Series.ipynb

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	../.virtual_documents/
	../3.1 Py_DS_ML_Bootcamp-master.zip - Copy/
	.ipynb_checkpoints/
	Groupby.ipynb
	../kite_tutorial-checkpoint.ipynb
	../kite_tutorial.ipynb

no changes added to commit (use "git add" and/or "git commit -a")

Everything up-to-date